app/views/renter/index.html.erb

<% if current_user %>
  <% current_user.favorites.each do |favorite| %>
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 6