app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
  def index
    @apts = Apartment.all

INSERT INTO "apartments" ("bathrooms", "bedrooms", "city", "created_at", "latitude", "longitude", "photo", "price", "region", "state", "street", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create #parses params hash (generated by user)
    @new_apt = Apartment.create(params[:apartment])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    if current_user && current_user.is_a_broker
      #feed the apt id into the view yadig
      @apt = Apartment.find(params[:id])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "apartments" SET "city" = 'Nowhere', "state" = 'NV', "zipcode" = '69696', "region" = 'butts row', "longitude" = '696969', "latitude" = '-80.085', "photo" = 'https://31.media.tumblr.com/tumblr_m877krR6W81qjgntqo1_500.jpg', "updated_at" = '2014-01-16 01:58:04.489279' WHERE "apartments"."id" = 3
---
  def update
    @apt = Apartment.find(params[:id])
    @apt.update_attributes(params[:apartment])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def show
    @apt = Apartment.find(params[:id])

SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 3]]
---
  def destroy
    @apt = Apartment.find(params[:id])
    @apt.destroy