app/controllers/apartment_controller.rb

SELECT "apartments".* FROM "apartments"
---
  def index
    @apts = Apartment.all