app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1
SELECT "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT 1  [["id", "4"]]
INSERT INTO "favorites" ("apartment_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["apartment_id", 4], ["created_at", Thu, 16 Jan 2014 23:36:49 UTC +00:00], ["updated_at", Thu, 16 Jan 2014 23:36:49 UTC +00:00], ["user_id", 6]]
---
    def add_favorite
      # render json: {:params => params, :current_user => current_user}
      # {"params":{"controller":"users","action":"add_favorite","apartment_id":"1"},"current_user":{"created_at":"2014-01-15T19:22:51Z","email":"julie@renter.com","id":6,"is_a_broker":false,"name":"Julie Renter","updated_at":"2014-01-16T21:51:45Z"}}
      user_id = current_user.id
      apartment_id = params[:apartment_id]

      user = User.find(user_id)
      apartment = Apartment.find(apartment_id)

      favorite = Favorite.create(user: user, apartment: apartment)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 6 AND "favorites"."apartment_id" = 4 LIMIT 1
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 3]]
---
    def unfavorite
      # no
      # @apt = Apartment.find(params[:apartment_id])
      # @favorite = Favorite.find(params[:favorite_id])

      favorite = Favorite.where(user_id: current_user.id, apartment_id: params[:apartment_id]).first
      favorite.destroy